zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_WKPU.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_WKPU.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_WKPU
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_WKPU_H_)  /* Check if memory map has not been already included */
#define S32K566_WKPU_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- WKPU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WKPU_Peripheral_Access_Layer WKPU Peripheral Access Layer
 * @{
 */

/** WKPU - Register Layout Typedef */
typedef struct WKPU_Struct {
  __IO uint32_t NSR;                               /**< NMI Status Flag, offset: 0x0 */
  __IO uint32_t NSR_8;                             /**< NMI Status Flag, offset: 0x4 */
  __IO uint32_t NCR;                               /**< NMI Configuration, offset: 0x8 */
  __IO uint32_t NCR_8;                             /**< NMI Configuration, offset: 0xC */
  __IO uint32_t WBMSR;                             /**< Wake-Up Boot Mode Select, offset: 0x10 */
  __IO uint32_t WISR;                              /**< Wake-Up and Interrupt Status Flag, offset: 0x14 */
  __IO uint32_t IRER;                              /**< Interrupt Request Enable, offset: 0x18 */
  __IO uint32_t WRER;                              /**< Wake-Up Request Enable, offset: 0x1C */
  uint8_t RESERVED_0[8];
  __IO uint32_t WIREER;                            /**< Wake-Up and Interrupt Rising-Edge Event Enable, offset: 0x28 */
  __IO uint32_t WIFEER;                            /**< Wake-Up and Interrupt Falling-Edge Event Enable, offset: 0x2C */
  __IO uint32_t WIFER;                             /**< Wake-Up and Interrupt Filter Enable, offset: 0x30 */
  uint8_t RESERVED_1[16];
  __IO uint32_t GPIO_QUAL;                         /**< GPIO Qualifier, offset: 0x44 */
  __IO uint32_t WKPU_NMI_BMSR;                     /**< NMI Boot Mode Select, offset: 0x48 */
  uint8_t RESERVED_2[4];
  __IO uint32_t WBMSR_64;                          /**< Wake-Up Boot Mode Select, offset: 0x50 */
  __IO uint32_t WISR_64;                           /**< Wake-Up and Interrupt Status Flag, offset: 0x54 */
  __IO uint32_t IRER_64;                           /**< Interrupt Request Enable, offset: 0x58 */
  __IO uint32_t WRER_64;                           /**< Wake-Up Request Enable, offset: 0x5C */
  uint8_t RESERVED_3[8];
  __IO uint32_t WIREER_64;                         /**< Wake-Up and Interrupt Rising-Edge Event Enable, offset: 0x68 */
  __IO uint32_t WIFEER_64;                         /**< Wake-Up and Interrupt Falling-Edge Event Enable, offset: 0x6C */
  __IO uint32_t WIFER_64;                          /**< Wake-Up and Interrupt Filter Enable, offset: 0x70 */
  uint8_t RESERVED_4[148];
  __IO uint32_t WBMSR_96;                          /**< Wake-Up Boot Mode Select, offset: 0x108 */
  __IO uint32_t WISR_96;                           /**< Wake-Up and Interrupt Status Flag, offset: 0x10C */
  __IO uint32_t IRER_96;                           /**< Interrupt Request Enable, offset: 0x110 */
  __IO uint32_t WRER_96;                           /**< Wake-Up Request Enable, offset: 0x114 */
  __IO uint32_t WIREER_96;                         /**< Wake-Up and Interrupt Rising-Edge Event Enable, offset: 0x118 */
  __IO uint32_t WIFEER_96;                         /**< Wake-Up and Interrupt Falling-Edge Event Enable, offset: 0x11C */
  __IO uint32_t WIFER_96;                          /**< Wake-Up and Interrupt Filter Enable, offset: 0x120 */
} WKPU_Type, *WKPU_MemMapPtr;

/** Number of instances of the WKPU module. */
#define WKPU_INSTANCE_COUNT                      (1u)

/* WKPU - Peripheral instance base addresses */
/** Peripheral LPE_WKPU base address */
#define IP_LPE_WKPU_BASE                         (0x4210C000u)
/** Peripheral LPE_WKPU base pointer */
#define IP_LPE_WKPU                              ((WKPU_Type *)IP_LPE_WKPU_BASE)
/** Array initializer of WKPU peripheral base addresses */
#define IP_WKPU_BASE_ADDRS                       { IP_LPE_WKPU_BASE }
/** Array initializer of WKPU peripheral base pointers */
#define IP_WKPU_BASE_PTRS                        { IP_LPE_WKPU }

/* ----------------------------------------------------------------------------
   -- WKPU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup WKPU_Register_Masks WKPU Register Masks
 * @{
 */

/*! @name NSR - NMI Status Flag */
/*! @{ */

#define WKPU_NSR_NOVF3_MASK                      (0x40U)
#define WKPU_NSR_NOVF3_SHIFT                     (6U)
#define WKPU_NSR_NOVF3_WIDTH                     (1U)
#define WKPU_NSR_NOVF3(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NOVF3_SHIFT)) & WKPU_NSR_NOVF3_MASK)

#define WKPU_NSR_NIF3_MASK                       (0x80U)
#define WKPU_NSR_NIF3_SHIFT                      (7U)
#define WKPU_NSR_NIF3_WIDTH                      (1U)
#define WKPU_NSR_NIF3(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NIF3_SHIFT)) & WKPU_NSR_NIF3_MASK)

#define WKPU_NSR_NOVF2_MASK                      (0x4000U)
#define WKPU_NSR_NOVF2_SHIFT                     (14U)
#define WKPU_NSR_NOVF2_WIDTH                     (1U)
#define WKPU_NSR_NOVF2(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NOVF2_SHIFT)) & WKPU_NSR_NOVF2_MASK)

#define WKPU_NSR_NIF2_MASK                       (0x8000U)
#define WKPU_NSR_NIF2_SHIFT                      (15U)
#define WKPU_NSR_NIF2_WIDTH                      (1U)
#define WKPU_NSR_NIF2(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NIF2_SHIFT)) & WKPU_NSR_NIF2_MASK)

