zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_WKPU.h
#define WKPU_NSR_NOVF1_MASK                      (0x400000U)
#define WKPU_NSR_NOVF1_SHIFT                     (22U)
#define WKPU_NSR_NOVF1_WIDTH                     (1U)
#define WKPU_NSR_NOVF1(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NOVF1_SHIFT)) & WKPU_NSR_NOVF1_MASK)

#define WKPU_NSR_NIF1_MASK                       (0x800000U)
#define WKPU_NSR_NIF1_SHIFT                      (23U)
#define WKPU_NSR_NIF1_WIDTH                      (1U)
#define WKPU_NSR_NIF1(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NIF1_SHIFT)) & WKPU_NSR_NIF1_MASK)

#define WKPU_NSR_NOVF0_MASK                      (0x40000000U)
#define WKPU_NSR_NOVF0_SHIFT                     (30U)
#define WKPU_NSR_NOVF0_WIDTH                     (1U)
#define WKPU_NSR_NOVF0(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NOVF0_SHIFT)) & WKPU_NSR_NOVF0_MASK)

#define WKPU_NSR_NIF0_MASK                       (0x80000000U)
#define WKPU_NSR_NIF0_SHIFT                      (31U)
#define WKPU_NSR_NIF0_WIDTH                      (1U)
#define WKPU_NSR_NIF0(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_NIF0_SHIFT)) & WKPU_NSR_NIF0_MASK)
/*! @} */

/*! @name NSR_8 - NMI Status Flag */
/*! @{ */

#define WKPU_NSR_8_NOVF6_MASK                    (0x4000U)
#define WKPU_NSR_8_NOVF6_SHIFT                   (14U)
#define WKPU_NSR_8_NOVF6_WIDTH                   (1U)
#define WKPU_NSR_8_NOVF6(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NOVF6_SHIFT)) & WKPU_NSR_8_NOVF6_MASK)

#define WKPU_NSR_8_NIF6_MASK                     (0x8000U)
#define WKPU_NSR_8_NIF6_SHIFT                    (15U)
#define WKPU_NSR_8_NIF6_WIDTH                    (1U)
#define WKPU_NSR_8_NIF6(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NIF6_SHIFT)) & WKPU_NSR_8_NIF6_MASK)

#define WKPU_NSR_8_NOVF5_MASK                    (0x400000U)
#define WKPU_NSR_8_NOVF5_SHIFT                   (22U)
#define WKPU_NSR_8_NOVF5_WIDTH                   (1U)
#define WKPU_NSR_8_NOVF5(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NOVF5_SHIFT)) & WKPU_NSR_8_NOVF5_MASK)

#define WKPU_NSR_8_NIF5_MASK                     (0x800000U)
#define WKPU_NSR_8_NIF5_SHIFT                    (23U)
#define WKPU_NSR_8_NIF5_WIDTH                    (1U)
#define WKPU_NSR_8_NIF5(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NIF5_SHIFT)) & WKPU_NSR_8_NIF5_MASK)

#define WKPU_NSR_8_NOVF4_MASK                    (0x40000000U)
#define WKPU_NSR_8_NOVF4_SHIFT                   (30U)
#define WKPU_NSR_8_NOVF4_WIDTH                   (1U)
#define WKPU_NSR_8_NOVF4(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NOVF4_SHIFT)) & WKPU_NSR_8_NOVF4_MASK)

#define WKPU_NSR_8_NIF4_MASK                     (0x80000000U)
#define WKPU_NSR_8_NIF4_SHIFT                    (31U)
#define WKPU_NSR_8_NIF4_WIDTH                    (1U)
#define WKPU_NSR_8_NIF4(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NSR_8_NIF4_SHIFT)) & WKPU_NSR_8_NIF4_MASK)
/*! @} */

/*! @name NCR - NMI Configuration */
/*! @{ */

#define WKPU_NCR_NFE3_MASK                       (0x1U)
#define WKPU_NCR_NFE3_SHIFT                      (0U)
#define WKPU_NCR_NFE3_WIDTH                      (1U)
#define WKPU_NCR_NFE3(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFE3_SHIFT)) & WKPU_NCR_NFE3_MASK)

#define WKPU_NCR_NFEE3_RFEE_MASK                 (0x2U)
#define WKPU_NCR_NFEE3_RFEE_SHIFT                (1U)
#define WKPU_NCR_NFEE3_RFEE_WIDTH                (1U)
#define WKPU_NCR_NFEE3_RFEE(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFEE3_RFEE_SHIFT)) & WKPU_NCR_NFEE3_RFEE_MASK)

#define WKPU_NCR_NREE3_RREE_MASK                 (0x4U)
#define WKPU_NCR_NREE3_RREE_SHIFT                (2U)
#define WKPU_NCR_NREE3_RREE_WIDTH                (1U)
#define WKPU_NCR_NREE3_RREE(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NREE3_RREE_SHIFT)) & WKPU_NCR_NREE3_RREE_MASK)

#define WKPU_NCR_NWRE3_RWRE_MASK                 (0x10U)
#define WKPU_NCR_NWRE3_RWRE_SHIFT                (4U)
#define WKPU_NCR_NWRE3_RWRE_WIDTH                (1U)
#define WKPU_NCR_NWRE3_RWRE(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NWRE3_RWRE_SHIFT)) & WKPU_NCR_NWRE3_RWRE_MASK)

#define WKPU_NCR_NDSS3_RDSS_MASK                 (0x60U)
#define WKPU_NCR_NDSS3_RDSS_SHIFT                (5U)
#define WKPU_NCR_NDSS3_RDSS_WIDTH                (2U)
#define WKPU_NCR_NDSS3_RDSS(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NDSS3_RDSS_SHIFT)) & WKPU_NCR_NDSS3_RDSS_MASK)

#define WKPU_NCR_NLOCK3_RLOCK_MASK               (0x80U)
#define WKPU_NCR_NLOCK3_RLOCK_SHIFT              (7U)
#define WKPU_NCR_NLOCK3_RLOCK_WIDTH              (1U)
#define WKPU_NCR_NLOCK3_RLOCK(x)                 (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NLOCK3_RLOCK_SHIFT)) & WKPU_NCR_NLOCK3_RLOCK_MASK)

#define WKPU_NCR_NFE2_MASK                       (0x100U)
#define WKPU_NCR_NFE2_SHIFT                      (8U)
#define WKPU_NCR_NFE2_WIDTH                      (1U)
#define WKPU_NCR_NFE2(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFE2_SHIFT)) & WKPU_NCR_NFE2_MASK)

#define WKPU_NCR_NFEE2_MASK                      (0x200U)
#define WKPU_NCR_NFEE2_SHIFT                     (9U)
#define WKPU_NCR_NFEE2_WIDTH                     (1U)
#define WKPU_NCR_NFEE2(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFEE2_SHIFT)) & WKPU_NCR_NFEE2_MASK)

#define WKPU_NCR_NREE2_MASK                      (0x400U)
#define WKPU_NCR_NREE2_SHIFT                     (10U)
#define WKPU_NCR_NREE2_WIDTH                     (1U)
#define WKPU_NCR_NREE2(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NREE2_SHIFT)) & WKPU_NCR_NREE2_MASK)

#define WKPU_NCR_NWRE2_MASK                      (0x1000U)
#define WKPU_NCR_NWRE2_SHIFT                     (12U)
#define WKPU_NCR_NWRE2_WIDTH                     (1U)
#define WKPU_NCR_NWRE2(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NWRE2_SHIFT)) & WKPU_NCR_NWRE2_MASK)

#define WKPU_NCR_NDSS2_MASK                      (0x6000U)
#define WKPU_NCR_NDSS2_SHIFT                     (13U)
#define WKPU_NCR_NDSS2_WIDTH                     (2U)
#define WKPU_NCR_NDSS2(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NDSS2_SHIFT)) & WKPU_NCR_NDSS2_MASK)

#define WKPU_NCR_NLOCK2_MASK                     (0x8000U)
#define WKPU_NCR_NLOCK2_SHIFT                    (15U)
#define WKPU_NCR_NLOCK2_WIDTH                    (1U)
#define WKPU_NCR_NLOCK2(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NLOCK2_SHIFT)) & WKPU_NCR_NLOCK2_MASK)

