zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_WKPU.h
#define WKPU_NCR_NFE1_MASK                       (0x10000U)
#define WKPU_NCR_NFE1_SHIFT                      (16U)
#define WKPU_NCR_NFE1_WIDTH                      (1U)
#define WKPU_NCR_NFE1(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFE1_SHIFT)) & WKPU_NCR_NFE1_MASK)

#define WKPU_NCR_NFEE1_MASK                      (0x20000U)
#define WKPU_NCR_NFEE1_SHIFT                     (17U)
#define WKPU_NCR_NFEE1_WIDTH                     (1U)
#define WKPU_NCR_NFEE1(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFEE1_SHIFT)) & WKPU_NCR_NFEE1_MASK)

#define WKPU_NCR_NREE1_MASK                      (0x40000U)
#define WKPU_NCR_NREE1_SHIFT                     (18U)
#define WKPU_NCR_NREE1_WIDTH                     (1U)
#define WKPU_NCR_NREE1(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NREE1_SHIFT)) & WKPU_NCR_NREE1_MASK)

#define WKPU_NCR_NWRE1_MASK                      (0x100000U)
#define WKPU_NCR_NWRE1_SHIFT                     (20U)
#define WKPU_NCR_NWRE1_WIDTH                     (1U)
#define WKPU_NCR_NWRE1(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NWRE1_SHIFT)) & WKPU_NCR_NWRE1_MASK)

#define WKPU_NCR_NDSS1_MASK                      (0x600000U)
#define WKPU_NCR_NDSS1_SHIFT                     (21U)
#define WKPU_NCR_NDSS1_WIDTH                     (2U)
#define WKPU_NCR_NDSS1(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NDSS1_SHIFT)) & WKPU_NCR_NDSS1_MASK)

#define WKPU_NCR_NLOCK1_MASK                     (0x800000U)
#define WKPU_NCR_NLOCK1_SHIFT                    (23U)
#define WKPU_NCR_NLOCK1_WIDTH                    (1U)
#define WKPU_NCR_NLOCK1(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NLOCK1_SHIFT)) & WKPU_NCR_NLOCK1_MASK)

#define WKPU_NCR_NFE0_MASK                       (0x1000000U)
#define WKPU_NCR_NFE0_SHIFT                      (24U)
#define WKPU_NCR_NFE0_WIDTH                      (1U)
#define WKPU_NCR_NFE0(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFE0_SHIFT)) & WKPU_NCR_NFE0_MASK)

#define WKPU_NCR_NFEE0_MASK                      (0x2000000U)
#define WKPU_NCR_NFEE0_SHIFT                     (25U)
#define WKPU_NCR_NFEE0_WIDTH                     (1U)
#define WKPU_NCR_NFEE0(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NFEE0_SHIFT)) & WKPU_NCR_NFEE0_MASK)

#define WKPU_NCR_NREE0_MASK                      (0x4000000U)
#define WKPU_NCR_NREE0_SHIFT                     (26U)
#define WKPU_NCR_NREE0_WIDTH                     (1U)
#define WKPU_NCR_NREE0(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NREE0_SHIFT)) & WKPU_NCR_NREE0_MASK)

#define WKPU_NCR_NWRE0_MASK                      (0x10000000U)
#define WKPU_NCR_NWRE0_SHIFT                     (28U)
#define WKPU_NCR_NWRE0_WIDTH                     (1U)
#define WKPU_NCR_NWRE0(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NWRE0_SHIFT)) & WKPU_NCR_NWRE0_MASK)

#define WKPU_NCR_NDSS0_MASK                      (0x60000000U)
#define WKPU_NCR_NDSS0_SHIFT                     (29U)
#define WKPU_NCR_NDSS0_WIDTH                     (2U)
#define WKPU_NCR_NDSS0(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NDSS0_SHIFT)) & WKPU_NCR_NDSS0_MASK)

#define WKPU_NCR_NLOCK0_MASK                     (0x80000000U)
#define WKPU_NCR_NLOCK0_SHIFT                    (31U)
#define WKPU_NCR_NLOCK0_WIDTH                    (1U)
#define WKPU_NCR_NLOCK0(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_NLOCK0_SHIFT)) & WKPU_NCR_NLOCK0_MASK)
/*! @} */

/*! @name NCR_8 - NMI Configuration */
/*! @{ */

#define WKPU_NCR_8_NFE6_MASK                     (0x100U)
#define WKPU_NCR_8_NFE6_SHIFT                    (8U)
#define WKPU_NCR_8_NFE6_WIDTH                    (1U)
#define WKPU_NCR_8_NFE6(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFE6_SHIFT)) & WKPU_NCR_8_NFE6_MASK)

#define WKPU_NCR_8_NFEE6_MASK                    (0x200U)
#define WKPU_NCR_8_NFEE6_SHIFT                   (9U)
#define WKPU_NCR_8_NFEE6_WIDTH                   (1U)
#define WKPU_NCR_8_NFEE6(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFEE6_SHIFT)) & WKPU_NCR_8_NFEE6_MASK)

#define WKPU_NCR_8_NREE6_MASK                    (0x400U)
#define WKPU_NCR_8_NREE6_SHIFT                   (10U)
#define WKPU_NCR_8_NREE6_WIDTH                   (1U)
#define WKPU_NCR_8_NREE6(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NREE6_SHIFT)) & WKPU_NCR_8_NREE6_MASK)

#define WKPU_NCR_8_NWRE6_MASK                    (0x1000U)
#define WKPU_NCR_8_NWRE6_SHIFT                   (12U)
#define WKPU_NCR_8_NWRE6_WIDTH                   (1U)
#define WKPU_NCR_8_NWRE6(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NWRE6_SHIFT)) & WKPU_NCR_8_NWRE6_MASK)

#define WKPU_NCR_8_NDSS6_MASK                    (0x6000U)
#define WKPU_NCR_8_NDSS6_SHIFT                   (13U)
#define WKPU_NCR_8_NDSS6_WIDTH                   (2U)
#define WKPU_NCR_8_NDSS6(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NDSS6_SHIFT)) & WKPU_NCR_8_NDSS6_MASK)

#define WKPU_NCR_8_NLOCK6_MASK                   (0x8000U)
#define WKPU_NCR_8_NLOCK6_SHIFT                  (15U)
#define WKPU_NCR_8_NLOCK6_WIDTH                  (1U)
#define WKPU_NCR_8_NLOCK6(x)                     (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NLOCK6_SHIFT)) & WKPU_NCR_8_NLOCK6_MASK)

#define WKPU_NCR_8_NFE5_MASK                     (0x10000U)
#define WKPU_NCR_8_NFE5_SHIFT                    (16U)
#define WKPU_NCR_8_NFE5_WIDTH                    (1U)
#define WKPU_NCR_8_NFE5(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFE5_SHIFT)) & WKPU_NCR_8_NFE5_MASK)

#define WKPU_NCR_8_NFEE5_MASK                    (0x20000U)
#define WKPU_NCR_8_NFEE5_SHIFT                   (17U)
#define WKPU_NCR_8_NFEE5_WIDTH                   (1U)
#define WKPU_NCR_8_NFEE5(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFEE5_SHIFT)) & WKPU_NCR_8_NFEE5_MASK)

#define WKPU_NCR_8_NREE5_MASK                    (0x40000U)
#define WKPU_NCR_8_NREE5_SHIFT                   (18U)
#define WKPU_NCR_8_NREE5_WIDTH                   (1U)
#define WKPU_NCR_8_NREE5(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NREE5_SHIFT)) & WKPU_NCR_8_NREE5_MASK)

#define WKPU_NCR_8_NWRE5_MASK                    (0x100000U)
#define WKPU_NCR_8_NWRE5_SHIFT                   (20U)
#define WKPU_NCR_8_NWRE5_WIDTH                   (1U)
#define WKPU_NCR_8_NWRE5(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NWRE5_SHIFT)) & WKPU_NCR_8_NWRE5_MASK)

#define WKPU_NCR_8_NDSS5_MASK                    (0x600000U)
#define WKPU_NCR_8_NDSS5_SHIFT                   (21U)
#define WKPU_NCR_8_NDSS5_WIDTH                   (2U)
#define WKPU_NCR_8_NDSS5(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NDSS5_SHIFT)) & WKPU_NCR_8_NDSS5_MASK)

#define WKPU_NCR_8_NLOCK5_MASK                   (0x800000U)
#define WKPU_NCR_8_NLOCK5_SHIFT                  (23U)
#define WKPU_NCR_8_NLOCK5_WIDTH                  (1U)
#define WKPU_NCR_8_NLOCK5(x)                     (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NLOCK5_SHIFT)) & WKPU_NCR_8_NLOCK5_MASK)

