zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_WKPU.h
#define WKPU_NCR_8_NFE4_MASK                     (0x1000000U)
#define WKPU_NCR_8_NFE4_SHIFT                    (24U)
#define WKPU_NCR_8_NFE4_WIDTH                    (1U)
#define WKPU_NCR_8_NFE4(x)                       (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFE4_SHIFT)) & WKPU_NCR_8_NFE4_MASK)

#define WKPU_NCR_8_NFEE4_MASK                    (0x2000000U)
#define WKPU_NCR_8_NFEE4_SHIFT                   (25U)
#define WKPU_NCR_8_NFEE4_WIDTH                   (1U)
#define WKPU_NCR_8_NFEE4(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NFEE4_SHIFT)) & WKPU_NCR_8_NFEE4_MASK)

#define WKPU_NCR_8_NREE4_MASK                    (0x4000000U)
#define WKPU_NCR_8_NREE4_SHIFT                   (26U)
#define WKPU_NCR_8_NREE4_WIDTH                   (1U)
#define WKPU_NCR_8_NREE4(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NREE4_SHIFT)) & WKPU_NCR_8_NREE4_MASK)

#define WKPU_NCR_8_NWRE4_MASK                    (0x10000000U)
#define WKPU_NCR_8_NWRE4_SHIFT                   (28U)
#define WKPU_NCR_8_NWRE4_WIDTH                   (1U)
#define WKPU_NCR_8_NWRE4(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NWRE4_SHIFT)) & WKPU_NCR_8_NWRE4_MASK)

#define WKPU_NCR_8_NDSS4_MASK                    (0x60000000U)
#define WKPU_NCR_8_NDSS4_SHIFT                   (29U)
#define WKPU_NCR_8_NDSS4_WIDTH                   (2U)
#define WKPU_NCR_8_NDSS4(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NDSS4_SHIFT)) & WKPU_NCR_8_NDSS4_MASK)

#define WKPU_NCR_8_NLOCK4_MASK                   (0x80000000U)
#define WKPU_NCR_8_NLOCK4_SHIFT                  (31U)
#define WKPU_NCR_8_NLOCK4_WIDTH                  (1U)
#define WKPU_NCR_8_NLOCK4(x)                     (((uint32_t)(((uint32_t)(x)) << WKPU_NCR_8_NLOCK4_SHIFT)) & WKPU_NCR_8_NLOCK4_MASK)
/*! @} */

/*! @name WBMSR - Wake-Up Boot Mode Select */
/*! @{ */

#define WKPU_WBMSR_WBMS_32_MASK                  (0xFFFFFFFFU)
#define WKPU_WBMSR_WBMS_32_SHIFT                 (0U)
#define WKPU_WBMSR_WBMS_32_WIDTH                 (32U)
#define WKPU_WBMSR_WBMS_32(x)                    (((uint32_t)(((uint32_t)(x)) << WKPU_WBMSR_WBMS_32_SHIFT)) & WKPU_WBMSR_WBMS_32_MASK)
/*! @} */

/*! @name WISR - Wake-Up and Interrupt Status Flag */
/*! @{ */

#define WKPU_WISR_EIF_MASK                       (0xFFFFFFFFU)
#define WKPU_WISR_EIF_SHIFT                      (0U)
#define WKPU_WISR_EIF_WIDTH                      (32U)
#define WKPU_WISR_EIF(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_WISR_EIF_SHIFT)) & WKPU_WISR_EIF_MASK)
/*! @} */

/*! @name IRER - Interrupt Request Enable */
/*! @{ */

#define WKPU_IRER_EIRE_MASK                      (0xFFFFFFFFU)
#define WKPU_IRER_EIRE_SHIFT                     (0U)
#define WKPU_IRER_EIRE_WIDTH                     (32U)
#define WKPU_IRER_EIRE(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_IRER_EIRE_SHIFT)) & WKPU_IRER_EIRE_MASK)
/*! @} */

/*! @name WRER - Wake-Up Request Enable */
/*! @{ */

#define WKPU_WRER_WRE_MASK                       (0xFFFFFFFFU)
#define WKPU_WRER_WRE_SHIFT                      (0U)
#define WKPU_WRER_WRE_WIDTH                      (32U)
#define WKPU_WRER_WRE(x)                         (((uint32_t)(((uint32_t)(x)) << WKPU_WRER_WRE_SHIFT)) & WKPU_WRER_WRE_MASK)
/*! @} */

/*! @name WIREER - Wake-Up and Interrupt Rising-Edge Event Enable */
/*! @{ */

#define WKPU_WIREER_IREE_MASK                    (0xFFFFFFFFU)
#define WKPU_WIREER_IREE_SHIFT                   (0U)
#define WKPU_WIREER_IREE_WIDTH                   (32U)
#define WKPU_WIREER_IREE(x)                      (((uint32_t)(((uint32_t)(x)) << WKPU_WIREER_IREE_SHIFT)) & WKPU_WIREER_IREE_MASK)
/*! @} */

/*! @name WIFEER - Wake-Up and Interrupt Falling-Edge Event Enable */
/*! @{ */

#define WKPU_WIFEER_IFEEx_MASK                   (0xFFFFFFFFU)
#define WKPU_WIFEER_IFEEx_SHIFT                  (0U)
#define WKPU_WIFEER_IFEEx_WIDTH                  (32U)
#define WKPU_WIFEER_IFEEx(x)                     (((uint32_t)(((uint32_t)(x)) << WKPU_WIFEER_IFEEx_SHIFT)) & WKPU_WIFEER_IFEEx_MASK)
/*! @} */

/*! @name WIFER - Wake-Up and Interrupt Filter Enable */
/*! @{ */

#define WKPU_WIFER_IFE_MASK                      (0xFFFFFFFFU)
#define WKPU_WIFER_IFE_SHIFT                     (0U)
#define WKPU_WIFER_IFE_WIDTH                     (32U)
#define WKPU_WIFER_IFE(x)                        (((uint32_t)(((uint32_t)(x)) << WKPU_WIFER_IFE_SHIFT)) & WKPU_WIFER_IFE_MASK)
/*! @} */

/*! @name GPIO_QUAL - GPIO Qualifier */
/*! @{ */

#define WKPU_GPIO_QUAL_PD1_PD0_MASK              (0x1U)
#define WKPU_GPIO_QUAL_PD1_PD0_SHIFT             (0U)
#define WKPU_GPIO_QUAL_PD1_PD0_WIDTH             (1U)
#define WKPU_GPIO_QUAL_PD1_PD0(x)                (((uint32_t)(((uint32_t)(x)) << WKPU_GPIO_QUAL_PD1_PD0_SHIFT)) & WKPU_GPIO_QUAL_PD1_PD0_MASK)

#define WKPU_GPIO_QUAL_PD2_PD0_MASK              (0x2U)
#define WKPU_GPIO_QUAL_PD2_PD0_SHIFT             (1U)
#define WKPU_GPIO_QUAL_PD2_PD0_WIDTH             (1U)
#define WKPU_GPIO_QUAL_PD2_PD0(x)                (((uint32_t)(((uint32_t)(x)) << WKPU_GPIO_QUAL_PD2_PD0_SHIFT)) & WKPU_GPIO_QUAL_PD2_PD0_MASK)

#define WKPU_GPIO_QUAL_Other_Power_Domains_MASK  (0xFFFFFFFCU)
#define WKPU_GPIO_QUAL_Other_Power_Domains_SHIFT (2U)
#define WKPU_GPIO_QUAL_Other_Power_Domains_WIDTH (30U)
#define WKPU_GPIO_QUAL_Other_Power_Domains(x)    (((uint32_t)(((uint32_t)(x)) << WKPU_GPIO_QUAL_Other_Power_Domains_SHIFT)) & WKPU_GPIO_QUAL_Other_Power_Domains_MASK)
/*! @} */

/*! @name WKPU_NMI_BMSR - NMI Boot Mode Select */
/*! @{ */

#define WKPU_WKPU_NMI_BMSR_NMIBMS_MASK           (0x7FU)
#define WKPU_WKPU_NMI_BMSR_NMIBMS_SHIFT          (0U)
#define WKPU_WKPU_NMI_BMSR_NMIBMS_WIDTH          (7U)
#define WKPU_WKPU_NMI_BMSR_NMIBMS(x)             (((uint32_t)(((uint32_t)(x)) << WKPU_WKPU_NMI_BMSR_NMIBMS_SHIFT)) & WKPU_WKPU_NMI_BMSR_NMIBMS_MASK)
/*! @} */

/*! @name WBMSR_64 - Wake-Up Boot Mode Select */
/*! @{ */

#define WKPU_WBMSR_64_WBMS_64_MASK               (0xFFFFFFFFU)
#define WKPU_WBMSR_64_WBMS_64_SHIFT              (0U)
#define WKPU_WBMSR_64_WBMS_64_WIDTH              (32U)
#define WKPU_WBMSR_64_WBMS_64(x)                 (((uint32_t)(((uint32_t)(x)) << WKPU_WBMSR_64_WBMS_64_SHIFT)) & WKPU_WBMSR_64_WBMS_64_MASK)
/*! @} */

/*! @name WISR_64 - Wake-Up and Interrupt Status Flag */
/*! @{ */

#define WKPU_WISR_64_EIF_1_MASK                  (0xFFFFFFFFU)
#define WKPU_WISR_64_EIF_1_SHIFT                 (0U)
#define WKPU_WISR_64_EIF_1_WIDTH                 (32U)
#define WKPU_WISR_64_EIF_1(x)                    (((uint32_t)(((uint32_t)(x)) << WKPU_WISR_64_EIF_1_SHIFT)) & WKPU_WISR_64_EIF_1_MASK)
/*! @} */

