zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_WKPU.h
/*! @name IRER_64 - Interrupt Request Enable */
/*! @{ */

#define WKPU_IRER_64_EIRE_1_MASK                 (0xFFFFFFFFU)
#define WKPU_IRER_64_EIRE_1_SHIFT                (0U)
#define WKPU_IRER_64_EIRE_1_WIDTH                (32U)
#define WKPU_IRER_64_EIRE_1(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_IRER_64_EIRE_1_SHIFT)) & WKPU_IRER_64_EIRE_1_MASK)
/*! @} */

/*! @name WRER_64 - Wake-Up Request Enable */
/*! @{ */

#define WKPU_WRER_64_WRE_1_MASK                  (0xFFFFFFFFU)
#define WKPU_WRER_64_WRE_1_SHIFT                 (0U)
#define WKPU_WRER_64_WRE_1_WIDTH                 (32U)
#define WKPU_WRER_64_WRE_1(x)                    (((uint32_t)(((uint32_t)(x)) << WKPU_WRER_64_WRE_1_SHIFT)) & WKPU_WRER_64_WRE_1_MASK)
/*! @} */

/*! @name WIREER_64 - Wake-Up and Interrupt Rising-Edge Event Enable */
/*! @{ */

#define WKPU_WIREER_64_IREE_1_MASK               (0xFFFFFFFFU)
#define WKPU_WIREER_64_IREE_1_SHIFT              (0U)
#define WKPU_WIREER_64_IREE_1_WIDTH              (32U)
#define WKPU_WIREER_64_IREE_1(x)                 (((uint32_t)(((uint32_t)(x)) << WKPU_WIREER_64_IREE_1_SHIFT)) & WKPU_WIREER_64_IREE_1_MASK)
/*! @} */

/*! @name WIFEER_64 - Wake-Up and Interrupt Falling-Edge Event Enable */
/*! @{ */

#define WKPU_WIFEER_64_IFEEx_1_MASK              (0xFFFFFFFFU)
#define WKPU_WIFEER_64_IFEEx_1_SHIFT             (0U)
#define WKPU_WIFEER_64_IFEEx_1_WIDTH             (32U)
#define WKPU_WIFEER_64_IFEEx_1(x)                (((uint32_t)(((uint32_t)(x)) << WKPU_WIFEER_64_IFEEx_1_SHIFT)) & WKPU_WIFEER_64_IFEEx_1_MASK)
/*! @} */

/*! @name WIFER_64 - Wake-Up and Interrupt Filter Enable */
/*! @{ */

#define WKPU_WIFER_64_IFE_1_MASK                 (0xFFFFFFFFU)
#define WKPU_WIFER_64_IFE_1_SHIFT                (0U)
#define WKPU_WIFER_64_IFE_1_WIDTH                (32U)
#define WKPU_WIFER_64_IFE_1(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_WIFER_64_IFE_1_SHIFT)) & WKPU_WIFER_64_IFE_1_MASK)
/*! @} */

/*! @name WBMSR_96 - Wake-Up Boot Mode Select */
/*! @{ */

#define WKPU_WBMSR_96_WBMS_96_MASK               (0xFU)
#define WKPU_WBMSR_96_WBMS_96_SHIFT              (0U)
#define WKPU_WBMSR_96_WBMS_96_WIDTH              (4U)
#define WKPU_WBMSR_96_WBMS_96(x)                 (((uint32_t)(((uint32_t)(x)) << WKPU_WBMSR_96_WBMS_96_SHIFT)) & WKPU_WBMSR_96_WBMS_96_MASK)
/*! @} */

/*! @name WISR_96 - Wake-Up and Interrupt Status Flag */
/*! @{ */

#define WKPU_WISR_96_EIF_1_MASK                  (0xFU)
#define WKPU_WISR_96_EIF_1_SHIFT                 (0U)
#define WKPU_WISR_96_EIF_1_WIDTH                 (4U)
#define WKPU_WISR_96_EIF_1(x)                    (((uint32_t)(((uint32_t)(x)) << WKPU_WISR_96_EIF_1_SHIFT)) & WKPU_WISR_96_EIF_1_MASK)
/*! @} */

/*! @name IRER_96 - Interrupt Request Enable */
/*! @{ */

#define WKPU_IRER_96_EIRE_1_MASK                 (0xFU)
#define WKPU_IRER_96_EIRE_1_SHIFT                (0U)
#define WKPU_IRER_96_EIRE_1_WIDTH                (4U)
#define WKPU_IRER_96_EIRE_1(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_IRER_96_EIRE_1_SHIFT)) & WKPU_IRER_96_EIRE_1_MASK)
/*! @} */

/*! @name WRER_96 - Wake-Up Request Enable */
/*! @{ */

#define WKPU_WRER_96_WRE_1_MASK                  (0xFU)
#define WKPU_WRER_96_WRE_1_SHIFT                 (0U)
#define WKPU_WRER_96_WRE_1_WIDTH                 (4U)
#define WKPU_WRER_96_WRE_1(x)                    (((uint32_t)(((uint32_t)(x)) << WKPU_WRER_96_WRE_1_SHIFT)) & WKPU_WRER_96_WRE_1_MASK)
/*! @} */

/*! @name WIREER_96 - Wake-Up and Interrupt Rising-Edge Event Enable */
/*! @{ */

#define WKPU_WIREER_96_IREE_1_MASK               (0xFU)
#define WKPU_WIREER_96_IREE_1_SHIFT              (0U)
#define WKPU_WIREER_96_IREE_1_WIDTH              (4U)
#define WKPU_WIREER_96_IREE_1(x)                 (((uint32_t)(((uint32_t)(x)) << WKPU_WIREER_96_IREE_1_SHIFT)) & WKPU_WIREER_96_IREE_1_MASK)
/*! @} */

/*! @name WIFEER_96 - Wake-Up and Interrupt Falling-Edge Event Enable */
/*! @{ */

#define WKPU_WIFEER_96_IFEEx_1_MASK              (0xFU)
#define WKPU_WIFEER_96_IFEEx_1_SHIFT             (0U)
#define WKPU_WIFEER_96_IFEEx_1_WIDTH             (4U)
#define WKPU_WIFEER_96_IFEEx_1(x)                (((uint32_t)(((uint32_t)(x)) << WKPU_WIFEER_96_IFEEx_1_SHIFT)) & WKPU_WIFEER_96_IFEEx_1_MASK)
/*! @} */

/*! @name WIFER_96 - Wake-Up and Interrupt Filter Enable */
/*! @{ */

#define WKPU_WIFER_96_IFE_2_MASK                 (0xFU)
#define WKPU_WIFER_96_IFE_2_SHIFT                (0U)
#define WKPU_WIFER_96_IFE_2_WIDTH                (4U)
#define WKPU_WIFER_96_IFE_2(x)                   (((uint32_t)(((uint32_t)(x)) << WKPU_WIFER_96_IFE_2_SHIFT)) & WKPU_WIFER_96_IFE_2_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group WKPU_Register_Masks */

/*!
 * @}
 */ /* end of group WKPU_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_WKPU_H_) */
